IDC_GUSBP_FRAME_METHOD                        = "設計方法"
IDC_GUSBP_RDO_EAM                             = "Equivalent T-stub Method"
IDC_GUSBP_RDO_FEM                             = "Finite Element Method"

IDC_GUSBP_FRM_WELD                            = "銲接"
IDC_GUSBP_CHK_WELD                            = "檢核銲接"
IDC_GUSBP_LBL_WELD_TT                         = "喉厚"
IDC_GUSBP_LBL_WELD_LX                         = "有效長度 (X向)"
IDC_GUSBP_LBL_WELD_LY                         = "有效長度 (Y向)"
IDC_GUSBP_LBL_WELD_LT                         = "有效長度 (拉力)"

IDC_GUSBP_FRAME_FACTOR                        = "螺孔因數"
IDC_STATIC_BOLT_HOLE_FACT_TEXT                = "承壓抵抗因數"

IDC_GUSBP_LABEL_GROUT_THK                     = "Grout"

/////// ESMC : EUROCODE Steel : Moment Bolt Connection
/////// IDD_ESMC_PMODE_DLG
IDC_GESMC_FRM_GNRL                            = "一般事項"
IDC_GESMC_LBL_NAME                            = "構件名稱"
IDC_GESMC_LBL_MUSE                            = "同步套用於 "
IDC_GESMC_CHK_DRAW_DIMS                       = "標示尺寸"
IDC_GESMC_CHK_DIMS_ONLY                       = "尺寸"
IDC_GESMC_RDO_DISP_TOTL                       = "全部"
IDC_GESMC_RDO_DISP_PLAN                       = "平面"
IDC_GESMC_RDO_DISP_ELEV                       = "立面"
IDC_GESMC_RDO_DISP_SIDE                       = "側面"
IDC_GESMC_FRM_BOLT_PROP                       = "螺栓性質"
IDC_GESMC_FRM_SROW_TYPE                       = "指定受剪列數"
IDC_GESMC_RDO_SROW_USER                       = "用戶指定"
IDC_GESMC_RDO_SROW_AUTO                       = "程式指定"
IDC_GESMC_LBL_BOLT_MATL                       = "材料"
IDC_GESMC_LBL_BOLT_NAME                       = "型號"
IDC_GESMC_LBL_BOLT_TYPE                       = "種類"
IDC_GESMC_RDO_BOLT_ORDI                       = "普通"
IDC_GESMC_RDO_BOLT_COUN                       = "埋頭"
IDC_GESMC_LBL_BOLT_LAYO                       = "配置"
IDC_GESMC_RDO_LAYO_USER                       = "自定義"
IDC_GESMC_RDO_LAYO_AUTO                       = "自動"
IDC_GESMC_FRM_BOLT_FACT                       = "螺栓因數"
IDC_GESMC_LBL_FACT_SLIP                       = "滑動因數"
IDC_GESMC_FRM_BOLT_LAYO                       = "螺栓配置"
IDC_GESMC_FRM_RSLT                            = "計算結果"
IDC_GESMC_BOLT_LAYOUT_AUTO                    = "螺栓配置 (自動)"
IDC_GESMC_BOLT_LAYOUT_USER                    = "螺栓配置 (自定義)"
IDC_GESMC_FRM_BOLT_PREV                       = "預覽"

/////// IDD_ESMC_LAYOUT_AUTO_DLG
IDC_GESMC_FRM_ROWS                            = "行列數"
IDC_GESMC_LBL_ROWS_COLM                       = "行數"
IDC_GESMC_LBL_ROWS_TOP                        = "列數 (上方)"
IDC_GESMC_LBL_ROWS_BOT                        = "列數 (下方)"
IDC_GESMC_LBL_ROWS_TOP_TENS                   = "列數 (上方, 拉力)"
IDC_GESMC_LBL_ROWS_BOT_SHEAR                  = "列數 (下方, 剪力)"
IDC_GESMC_FRM_LENG                            = "範圍"
IDC_GESMC_LBL_EXTNS_HOR                       = "水平向延伸"
IDC_GESMC_LBL_EXTNS_VER                       = "垂直向延伸"
IDC_GESMC_LBL_EXTNS_TOP                       = "上方延伸"
IDC_GESMC_LBL_EXTNS_BOT                       = "下方延伸"
IDC_GESMC_LBL_SPACE_HOR                       = "水平間距"
IDC_GESMC_LBL_SPACE_VER                       = "垂直間距"
IDC_GESMC_LBL_SPACE_OFF                       = "Offset"
IDC_GESMC_CHK_SPACE_OFF                       = "考慮腹板厚度"

/////// IDD_ESMC_LAYOUT_USER_LIST_DLG
IDD_ESMC_LAYOUT_USER_LIST_DLG                 = "螺栓配置 (自定義)"
IDC_GESMC_FRM_SEL                             = "選擇構件"

/////// IDD_ESMC_LAYOUT_USER_DLG
IDC_GESMC_FRM_TOP                             = "上方"
IDC_GESMC_FRM_BOT                             = "下方"
IDC_GESMC_FRM_TOP_TENS                        = "上方 (拉力)"
IDC_GESMC_FRM_BOT_SHEAR                       = "下方 (剪力)"

/////// IDD_ESMC_USER_SPACE_DLG
IDC_GESMC_BTN_ADD                             = "新增"
IDC_GESMC_BTN_INS                             = "插入"
IDC_GESMC_BTN_DEL                             = "刪除"
IDC_GESMC_BTN_RES                             = "重設"

/////// IDD_ESMC_GIRD_DLG
IDC_GESMC_FRM_GIRD                            = "大梁數量"
IDC_GESMC_RDO_GIRD_SID1                       = "單側 ( 1 Side )"
IDC_GESMC_RDO_GIRD_SID2                       = "雙側 ( 2 Sides )"
IDC_GESMC_FRM_PLAT                            = "端板"
IDC_GESMC_LBL_PLAT_MATL                       = "材料"
IDC_GESMC_LBL_PLAT_THCK                       = "厚度"
IDC_GESMC_LBL_PLAT_WIDT                       = "寬度"
IDC_GESMC_LBL_PLAT_EXTT                       = "上方延伸"
IDC_GESMC_LBL_PLAT_EXTB                       = "下方延伸"

/////// IDD_ESMC_GIRD_SECT_DLG
IDC_GESMC_FRM_SECT                            = "斷面"
IDC_GESMC_FRM_ANGL                            = "角度"
IDC_GESMC_LBL_ANGL                            = "角度"
IDC_GESMC_FRM_MATL                            = "材料"
IDC_GESMC_LBL_MATL                            = "材料"
IDC_GESMC_FRM_WELD                            = "Leg長度"
IDC_GESMC_LBL_WEBT                            = "腹板"
IDC_GESMC_LBL_FLGT                            = "翼板"

/////// IDD_ESMC_COLM_DLG
IDC_GESMC_FRM_COLM                            = "柱子數量"
IDC_GESMC_RDO_COLM_SID1                       = "單柱 (僅下方)"
IDC_GESMC_RDO_COLM_SID2                       = "雙柱 (下方+上方)"
IDC_GESMC_FRM_FACT                            = "折減因數 ( Kwc )"
IDC_GESMC_LBL_TYPE                            = "類型"
IDC_GESMC_LBL_FACT                            = "因數"
IDC_GESMC_TOOLTIP_REDUCT_FACT_KCW             = "柱子腹板受壓時會考慮此折減因數"

/////// IDD_ESMC_BRCK_SECT_DLG
IDC_GESMC_CHK_BRCK                            = "使用托架"
IDC_GESMC_FRM_TYPE                            = "類型"
IDC_GESMC_FRM_SIZE                            = "尺寸"
IDC_GESMC_LBL_LENG                            = "長度"
IDC_GESMC_LBL_HEI1                            = "高度1"
IDC_GESMC_LBL_HEI2                            = "高度2"
IDC_GESMC_FRM_CLAS                            = "組合斷面等級"
IDC_GESMC_LBL_CLAS                            = "選擇等級"
IDC_GESMC_LBL_SECZ                            = "選擇係數"

/////// IDD_ESMC_STIF_DLG
IDC_GESMC_FRM_TOP_FLNG                        = "上翼板"
IDC_GESMC_CHK_TOP_APPL                        = "使用加勁板"
IDC_GESMC_LBL_TOP_MATL                        = "材料"
IDC_GESMC_LBL_TOP_THCK                        = "厚度"
IDC_GESMC_LBL_TOP_WIDT                        = "寬度"
IDC_GESMC_LBL_TOP_CORN                        = "截角尺寸"
IDC_GESMC_FRM_BOT_FLNG                        = "下翼板"
IDC_GESMC_CHK_BOT_APPL                        = "使用加勁板"
IDC_GESMC_LBL_BOT_MATL                        = "材料"
IDC_GESMC_LBL_BOT_THCK                        = "厚度"
IDC_GESMC_LBL_BOT_WIDT                        = "寬度"
IDC_GESMC_LBL_BOT_CORN                        = "截角尺寸"
IDC_GESMC_FRM_WEB                             = "柱腹板"
IDC_GESMC_CHK_WEB_APPL                        = "使用加勁板"
IDC_GESMC_LBL_WEB_TYPE                        = "類型"
IDC_GESMC_LBL_WEB_MATL                        = "材料"
IDC_GESMC_LBL_WEB_THCK                        = "厚度"
IDC_GESMC_LBL_WEB_WIDT                        = "寬度"
IDC_GESMC_LBL_WEB_HEIG                        = "高度"
IDC_GESMC_LBL_WEB_SIDE                        = "數量"

/////// IDD_ESMC_FORC_UNIT_DLG
IDC_GESMC_LBL_FX                              = "軸力"
IDC_GESMC_LBL_MX                              = "彎矩 ( X )"
IDC_GESMC_LBL_MY                              = "彎矩 ( Y )"
IDC_GESMC_LBL_VX                              = "剪力 ( X )"
IDC_GESMC_LBL_VY                              = "剪力 ( Y )"

/////// IDD_ESMC_BRCK_PLAT_DLG
IDC_GESMC_LBL_THCK                            = "厚度"

/////// IDD_ESMC_LOAD_COMB_DLG
IDD_ESMC_LOAD_COMB_DLG                        = "載重組合"
IDC_GESMC_LCOM_BTN_ALL                        = "全選"
IDC_GESMC_LCOM_BTN_NON                        = "取消全選"
IDC_GESMC_LCOM_BTN_INV                        = "反選"
IDC_GESMC_LCOM_BTN_ADD                        = "新增"
IDC_GESMC_LCOM_BTN_INS                        = "插入"
IDC_GESMC_LCOM_BTN_DEL                        = "刪除"
IDC_GESMC_LCOM_BTN_OK                         = "確認"
IDC_GESMC_LCOM_BTN_CANCEL                     = "取消"

/////// IDD_ESSG_SMODE_INPUT_SECT1_DLG
IDC_GESSG_FRAME_MATERIAL                      = "材料"     
IDC_GESSG_LABEL_MATERIAL     				  =	"材料"
IDC_GESSG_FRAME_MEMBER       				  =	"構件類型"
IDC_GESSG_RADIO_MEMBER_BEAM  				  =	"梁"
IDC_GESSG_RADIO_MEMBER_COLUMN				  =	"柱"
IDC_GESSG_FRAME_SECTION      				  =	"斷面"

/////// IDD_ESSG_SMODE_INPUT_SECT2_DLG
IDC_GESSG_FRAME_FORCE                         = "外力&&係數" 
IDC_GESSG_LABEL_FORCE_AXIAL					  =	"軸力"
IDC_GESSG_LABEL_FORCE_MX   					  =	"彎矩 (x)"
IDC_GESSG_LABEL_FORCE_MY   					  =	"彎矩 (y)"
IDC_GESSG_LABEL_FORCE_VX   					  =	"剪力 (x)"
IDC_GESSG_LABEL_FORCE_VY   					  =	"剪力 (y)"
IDC_GESSG_LABEL_FORCE_TORSION                 = "扭力"
IDC_GESSG_LABEL_FACTOR_C1                     =	"C1"
IDC_GESSG_LABEL_FACTOR_C2                     =	"C2"
IDC_GESSG_RDO_ANX_A                           =	"kij Method 1 - Annex A"
IDC_GESSG_RDO_ANX_B        					  =	"kij Method 2 - Annex B"
IDC_GESSG_LABEL_FACTOR_CMX                    =	"Cmx"
IDC_GESSG_LABEL_FACTOR_CMY 					  =	"Cmy"
IDC_GESSG_LABEL_FACTOR_CMLT					  =	"CmLT"
IDC_GESSG_INPUT_BTN_LCOMB                     =	"載重組合"
IDC_GESSG_FRAME_LENGTH                        = "長度"
IDC_GESSG_LABEL_LENGTH_LX  					  = "Lx"
IDC_GESSG_LABEL_LENGTH_LY  					  = "Ly"
IDC_GESSG_LABEL_LENGTH_LT  					  = "Lt"
IDC_GESSG_LABEL_LENGTH_LB  					  = "Lb"
IDC_GESSG_LABEL_LENGTH_KX  					  = "kx"
IDC_GESSG_LABEL_LENGTH_KY  					  = "ky"
IDC_GESSG_FRAME_PROPERTY                      = "斷面性質"
IDC_GESSG_FRAME_RESULT                        = "計算結果"